1.1 Elasticsearch
     1.1.0.ES是什么
       1.ES定义(搜索引擎)：一个搜索引擎：全文搜索，基于Lucene的开源，分布式，RestFul。
       2.ES定义(数据库): 一个分布式文档数据库：
                    1.每个字段均是被索引的数据，且可以被搜索
                    2.能够扩展至数百万的服务器
                    3.能够存储PB级别的数据
                    4.可以在很短的时间内存储，搜索和分析大量数据
       3.ES作用: 通常作为复杂搜索情况下的核心发动机
       4.ES的扩展：(使用垂直扩展的方式还是有限的，使用最多的还是水平扩展)（ES是天生分布式的，不需要做更多的改动就可以完成分布式的改动）
          4.1 垂直扩展/向上扩展:使用性能更强的服务器
          4.2 水平扩展/外向扩展:增加服务器的数量              
       5.ES的使用场景:
          5.1 提供精准的搜索，推荐相关商品
          5.2 用于搜索和汇总log日志（使用logstash工具...）
          5.3 用于提醒用户。把数据存储到ES中，使用定时器来过滤用户的需求
          5.4 大数据的可视化。大量数据的情况下（千万条数据以上）可以使用Kibana或者自定义的语言，使用ES的聚合功能来查询
       6.ES使用案例：
         6.1 GitHub的搜索是基于ES构建的
