1.2.2-Lucene倒排索引
  1.倒排索引的由来：
    源于实际中需要根据属性值来查找记录。
  2.倒排索引的特点：
    2.1 每一项都包含一个属性值和具有该属性值的各个记录地址.
    2.2 索引对象:文档或者文档集合中的单词
    2.3 存储内容:单词在一个文档或者一组文档中的存储位置
    2.4 一种最常用的索引机制:对文档或者文档集合的
  3.倒排索引的定义：
    3.1 不是由记录来确定属性值，倒过来使用属性值去确定记录
    3.2 带有倒排索引的文件我们称为倒排索引文件，简称倒排文件。
  4.倒排索引的关键步骤:建立倒排索引
    4.1 倒排索引一般表示为一个关键词,它的频度（出现次数），它的位置->类似书的标签，目录一般。
  5.倒排索引举例：（介绍结构和相应的生成算法）
    前置条件:
        文章1：Tom lives in Guangzhou ， I live in Guangzhou too.
	文章2：He once lived in Shanghai.
     5.1 取得关键词
        5.1.1 分词：需要找到文章中的所有单词。
	            英文比较好处理，中文单词需要特殊的分词器。
	5.1.2 过滤：英文中的in once too和中文的是，的属于没有特殊意义的单词，可以被过滤掉（还有标点符号）
	5.1.3 统一：用户希望查询He时可以查询出he ，HE。所有需要统一大小写
	5.1.4 还原：用户希望查询live能查询出lives和lived的文章。所以需要把lives和lived还原成live
        以上由Analyzer类完成。处理结果如下：
	文章1：[tom] [live]  [guangzhou] [i] [live] [guangzhou]
        文章2：[he] [live] [shanghai]

      
      5.2 建立倒排索引:
        5.2.1 建立关键词->文章号关系: 根据上面的关键词可以得到：文章号->关键词，然后反过来变成 关键词->文章号（倒排）
	5.2.2 建立关键词->文章号[出现频率] -> 出现位置:(live 1[2] 2,5)
     注意：Lucene的关键字是按照字符顺序的，没有使用B树，可以使用二元法来快速查询	

          

    
  
